---
kind: method
id: M:Autodesk.Revit.DB.NumberingSchemaType.#ctor(System.Guid)
source: html/2839f957-d88b-44d5-f5ab-e350523329f9.htm
---
# Autodesk.Revit.DB.NumberingSchemaType.#ctor Method

Creates a new NumberingSchemaType instance.

## Syntax (C#)
```csharp
public NumberingSchemaType(
	Guid guid
)
```

## Parameters
- **guid** (`System.Guid`) - The identifier for the NumberingSchemaType.